<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <title>Задание 3.6</title>
</head>
<body>
<?php
$flowers = [
    [
        "name" => "magnolia",
        "лепестки" => "8",
        "тычинки" => "5",
        "пестики" => "2",
        "цвет" => "белый"
    ],
    [
        "name" => "primula",
        "лепестки" => "10",
        "тычинки" => "5",
        "пестики" => "5",
        "цвет" => "алый"
    ],
    [
        "name" => "campanula latifolia",
        "лепестки" => "10",
        "тычинки" => "5",
        "пестики" => "3",
        "цвет" => "фиолетовый"
    ]
];

echo "<h3>Анализ скрипта с цветами</h3>";
echo "Скрипт выводит для каждого цветка его название, число лепестков и число тычинок.<br><br>";

for ($row = 0; $row < 3; $row++) {
    echo "|" . $flowers[$row]["name"] . "|" . $flowers[$row]["лепестки"] . "|" .
        $flowers[$row]["тычинки"] . "| <br>";
}
?>
</body>
</html>
