<html>
<head>
    <title>Задание 1.4</title>
</head>
<body>
    <?php
    echo "Привет от PHP!<br>";

    echo "Это занимает
несколько строк. Переводы строки тоже
выводятся";

    echo "Это занимает \n несколько строк. Переводы строки тоже \n выводятся";

    echo "Выводится число";
    echo 123687;

    echo 'Также вы можете вставлять в строки
символ новой строки таким образом,
поскольку это нормально';

    echo 'Однажды Арнольд сказал: "I\'ll be back"';
    echo 'Вы удалили C:\\*.*?';
    echo 'Вы удалили C:\*.*?';
    echo 'Это не вставит: \n новую строку';
    ?>
</body>
</html>
