<!DOCTYPE html>
<html lang="ru">

<head>
  <meta charset="UTF-8">
  <title>Задание 3.9</title>
</head>

<body>
  <?php
$menu1 = [
    "первое" => ["борщ"],
    "второе" => ["котлета с картофелем"],
    "десерт" => ["мороженое", "пирожное", "яблочный пирог"]
];

  $menu2 = [
      "первое" => ["борщ", "суп-лапша"],
      "второе" => ["котлета с картофелем", "рыба с рисом"],
      "десерт" => ["мороженое", "пирожное"]
  ];

  echo "<h3>Меню ресторана. Вариант 1</h3>";
  echo "<pre>";
  print_r($menu1);
  echo "</pre>";

  echo "<h3>Меню ресторана. Вариант 2</h3>";
  echo "<pre>";
  print_r($menu2);
  echo "</pre>";
  ?>
</body>

</html>